Revit 2023 API
FabricSheet.BentFabricLongitudinalCutLength Property
 Specifies the cut length of the fabric sheet perpendicular to the bend edge.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2016
Syntax
C#
public double BentFabricLongitudinalCutLength { get; set; }
Visual Basic
Public Property BentFabricLongitudinalCutLength As Double
	Get
	Set
Visual C++
public:
property double BentFabricLongitudinalCutLength {
	double get ();
	void set (double value);
}
Remarks
 Zero indicates that the fabric sheet is not shortened. This parameter applies only to bent fabric sheets.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for bentFabricLongitudinalCutLength must be between 0 and 30000 feet.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidObjectException |  When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace